---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralSectionCantileverHeight
source: html/3f8dc2b4-1c46-7438-66c8-799acef150fc.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralSectionCantileverHeight Property

"Cantilever Height"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralSectionCantileverHeight { get; }
```